In [1]:
import numpy as np
import pandas as pd

1 Qué diferencia hay entre una Serie y un DataFrame?

la serie es una fila y el dataframe son dos, es bidimensional

2 Crea dos listas:
Una que se llame "valores" que tenga 7 números aleatorios.
Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.
A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y 
la variable indices sean los índices de la Serie.

In [2]:
#valores= np.random.randint(1, 11, 7)
#valores
#valores1 = list(valores)
#valores1

In [3]:
valores = [1,3,5,7,2,4,6]
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]

In [4]:
pd.DataFrame(valores, indices)

           0
lunes      1
martes     3
miercoles  5
jueves     7
viernes    2
sabado     4
domingo    6

3 A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite 
iterar por dos listas a la vez. Más informción sobre este método aquí.
Crea una Serie con el diccionario creado en el punto anterior.

In [5]:
diccionario = {}
for valor, indice in zip(valores, indices):
    diccionario[valor] = indice

In [6]:
diccionario

{1: 'lunes',
 3: 'martes',
 5: 'miercoles',
 7: 'jueves',
 2: 'viernes',
 4: 'sabado',
 6: 'domingo'}

5 Crea una Serie con el diccionario creado en el punto anterior.

In [53]:
serie_diccionario = pd.Series(valores, index=indices)
print(serie_diccionario)

lunes        1
martes       3
miercoles    5
jueves       7
viernes      2
sabado       4
domingo      6
dtype: int64

#6 ¿Qué forma tiene esta última Serie?

In [54]:
serie_diccionario.shape

(7,)

#7 ¿Qué tipo de datos tiene?

In [55]:
serie_diccionario.dtype

dtype('int64')

#8 ¿Qué tamaño tiene?

In [56]:
serie_diccionario.size

7

#9 ¿Cuáles son los índices de la Serie?

In [57]:
serie_diccionario.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

10¿Y los values?

In [58]:
serie_diccionario.values

array([1, 3, 5, 7, 2, 4, 6])

11 Extrae el valor para el índice "lunes"

In [59]:
print(serie_diccionario["lunes"])

1

12 Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [66]:
serie_diccionario[["lunes","martes","miercoles"]]

lunes        1
martes       3
miercoles    5
dtype: int64

13 Extrae el valor para el índice "lunes" y "domingo".

In [67]:
serie_diccionario[["lunes","domingo"]]

lunes      1
domingo    6
dtype: int64

DATAFRAMES

14 Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [68]:
array14 = np.random.randint(1,20,(4,3))

15 Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [69]:
pd_medallas=pd.DataFrame(array14,columns= ["España","Francia", "Italia"])

In [70]:
pd_medallas.head()

   España  Francia  Italia
0      17       12       8
1       3        7      14
2      15       11      13
3      14        3       5

16 Descarga el archivo "medallas" y carga el DataFrame.

In [73]:
tabla_medallas = pd.read_csv("medallas.csv", index_col=0)
tabla_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

17 Usando el loc extrae todas las columnas de la fila de Tailandia.

In [84]:
tai = tabla_medallas.loc[7, :]
tai

País      Tailandia
Oro             132
Plata           175
Bronce          278
Total           585
Name: 7, dtype: object

18 Usando el loc extrae todas las columnas de China e Irán.

In [89]:
chinairan=tabla_medallas.loc[[1,4], :]
chinairan

    País   Oro  Plata  Bronce  Total
1  China  1473    994     720   3187
4   Irán   179    181     197    557

19 Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [91]:
chinairan2=tabla_medallas.loc[[1,4],["Oro", "Plata", "Bronce"]]
chinairan2

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

20 Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [41]:
tabla_medallas.loc[[6,]]

    País  Oro  Plata  Bronce
6  India  154    202     315

21 Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [92]:
impar = tabla_medallas.iloc[1::2, :]
print(impar)

               País   Oro  Plata  Bronce  Total
2             Japón  1032   1037     985   3054
4              Irán   179    181     197    557
6             India   154    202     315    671
8         Indonesia   112    131     240    483
10  Corea del Norte    91    120     235    446

22 Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [93]:
impar2= impar.iloc[:, 1:4]
print(impar2)

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

23 ¿Qué país consiguió más de 200 medallas de oro?

In [97]:
oro = tabla_medallas.loc[(tabla_medallas["Oro"]>200)]
oro

            País   Oro  Plata  Bronce  Total
1          China  1473    994     720   3187
2          Japón  1032   1037     985   3054
3  Corea del Sur   745    663     827   2235

24 ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [98]:
oroplata = tabla_medallas.loc[(tabla_medallas["Oro"]>200) & (tabla_medallas["Plata"]>1000)]
oroplata

    País   Oro  Plata  Bronce  Total
2  Japón  1032   1037     985   3054

25 ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [96]:
oroybronce = tabla_medallas.loc[(tabla_medallas["Oro"]>200) & (tabla_medallas["Bronce"]>700)]
print(oroybronce)

            País   Oro  Plata  Bronce  Total
1          China  1473    994     720   3187
2          Japón  1032   1037     985   3054
3  Corea del Sur   745    663     827   2235

26Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [80]:
tabla_medallas["Total"] = tabla_medallas["Oro"] + tabla_medallas["Plata"] + tabla_medallas["Bronce"]
tabla_medallas

               País   Oro  Plata  Bronce  Total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446